In [1]:
import pandas as pd

/Users/skunkworks/.pyenv/versions/3.7.4/envs/python-data/lib/python3.7/site-packages/pandas/compat/__init__.py:85: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)
/Users/skunkworks/.pyenv/versions/3.7.4/envs/python-data/lib/python3.7/site-packages/pandas/compat/__init__.py:85: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [16]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2010_1102/00282.htm')

In [17]:
df = df[2]

In [18]:
df.shape

(162, 10)

In [19]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9
0,NaN,NaN,"Echols (R) 1,406,713","Moffett (D) 1,029,614","Sendelbach (Lib) 94,950","Totals 2,531,277",NaN,NaN,NaN,NaN
1,NaN,NaN,55.6%,40.7%,3.8%,100.0%,NaN,NaN,NaN,NaN
2,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,APPLING,100%,3562,1221,128,4911,NaN,NaN,NaN,NaN
4,ATKINSON,100%,944,433,37,1414,NaN,NaN,NaN,NaN

In [20]:
df = df[3:]

In [21]:
df.head(5)

          0     1     2     3    4      5   6   7   8   9
3   APPLING  100%  3562  1221  128   4911 NaN NaN NaN NaN
4  ATKINSON  100%   944   433   37   1414 NaN NaN NaN NaN
5     BACON  100%  1822   470   55   2347 NaN NaN NaN NaN
6     BAKER  100%   587   580   20   1187 NaN NaN NaN NaN
7   BALDWIN  100%  5326  5347  291  10964 NaN NaN NaN NaN

In [22]:
df = df[df.columns[[0,2,3,4]]]

In [23]:
df.head(5)

          0     2     3    4
3   APPLING  3562  1221  128
4  ATKINSON   944   433   37
5     BACON  1822   470   55
6     BAKER   587   580   20
7   BALDWIN  5326  5347  291

In [24]:
df.columns = ['county', 'Tim Echols', 'Keith Moffett', 'James (Jim) Sendelbach']

In [25]:
df.tail(5)

        county Tim Echols Keith Moffett James (Jim) Sendelbach
157  WHITFIELD      11787          3416                    687
158     WILCOX       1385           623                     40
159     WILKES       2135          1394                     71
160  WILKINSON       1591          1644                     60
161      WORTH       4041          1664                    135

In [26]:
df = df.melt(id_vars=['county'])

In [27]:
df.columns = ['county', 'candidate', 'votes']

In [28]:
df.head()

     county   candidate votes
0   APPLING  Tim Echols  3562
1  ATKINSON  Tim Echols   944
2     BACON  Tim Echols  1822
3     BAKER  Tim Echols   587
4   BALDWIN  Tim Echols  5326

In [29]:
df['votes'] = df['votes'].astype(int)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 477 entries, 0 to 476
Data columns (total 3 columns):
county       477 non-null object
candidate    477 non-null object
votes        477 non-null int64
dtypes: int64(1), object(2)
memory usage: 11.3+ KB

In [31]:
df['office'] = 'Public Service Commission'

In [32]:
df['district'] = '2'

In [33]:
df.loc[df['candidate'] == 'Tim Echols', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Keith Moffett', 'party'] = 'Democrat'
df.loc[df['candidate'] == 'James (Jim) Sendelbach', 'party'] = 'Libertarian'

In [34]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate               party
James (Jim) Sendelbach  Libertarian      94950
Keith Moffett           Democrat       1029614
Tim Echols              Republican     1406713
Name: votes, dtype: int64

In [35]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county                     office district       party   candidate  votes
0   APPLING  Public Service Commission        2  Republican  Tim Echols   3562
1  ATKINSON  Public Service Commission        2  Republican  Tim Echols    944
2     BACON  Public Service Commission        2  Republican  Tim Echols   1822
3     BAKER  Public Service Commission        2  Republican  Tim Echols    587
4   BALDWIN  Public Service Commission        2  Republican  Tim Echols   5326

In [36]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')